-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2024-06-07 12:40:57
-- 伺服器版本： 10.4.32-MariaDB
-- PHP 版本： 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+08:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫： `fundodo`
--

-- --------------------------------------------------------

--
-- 資料表結構 `coupons`
--

CREATE TABLE `coupons` (
  `id` int(6) UNSIGNED NOT NULL,
  `name` varchar(20) NOT NULL,
  `code` varchar(20) NOT NULL,
  `category` int(10) NOT NULL,
  `coupontype` varchar(10) NOT NULL,
  `value` decimal(5,0) NOT NULL,
  `description` varchar(50) NOT NULL,
  `min_limit` decimal(5,0) NOT NULL,
  `start_date` date NOT NULL,
  `end_date` date NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  `status` int(5) NOT NULL DEFAULT 1
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `coupons`
--

INSERT INTO `coupons` (`id`, `name`, `code`, `category`, `coupontype`, `value`, `description`, `min_limit`, `start_date`, `end_date`, `created_at`, `status`) VALUES
(1, '全館商品滿額85折', '1IKPZT', 1, '%折扣', 85, '全館商品滿1000元85折', 1000, '2024-05-28', '2024-06-30', '2024-06-06 01:37:21', 1),
(2, '新客9折券', '0O554K', 2, '%折扣', 90, '新客享9折', 500, '2024-05-29', '2024-06-30', '2024-06-06 09:15:19', 1),
(3, '端午節88折券', '7N5HJ6', 1, '%折扣', 88, '端午節88折', 1000, '2024-05-29', '2024-06-30', '2024-06-06 09:15:50', 1),
(4, '國際小狗日8折券', 'CYR0JF', 1, '%折扣', 80, '3/23 國際小狗日8折券', 1000, '2024-03-23', '2024-03-23', '2024-06-06 01:47:43', 1),
(5, '3/20週年慶7折券', 'HYMESQ', 1, '%折扣', 70, '翻肚肚週年慶7折', 2000, '2024-03-15', '2024-03-25', '2024-06-06 01:47:39', 1),
(6, '滿1000元 減100', '6BZLZL', 2, '固定金額', 100, '滿1000元 減100', 1000, '2024-05-28', '2024-06-30', '2024-06-06 09:15:57', 1),
(7, '滿1000元 減200', 'LRYG2X', 3, '固定金額', 200, '滿1500元 減200', 1500, '2024-05-29', '2024-06-30', '2024-06-06 09:15:34', 1),
(8, '一起寵汪汪', 'PEJZB4', 1, '固定金額', 111, '一起寵汪汪 滿1111元-111', 1111, '2024-07-01', '2024-07-31', '2024-06-06 09:16:03', 1),
(9, '汪汪跨年500元券', 'PYX6TH', 1, '固定金額', 500, '迎接2024 滿3000-500', 3000, '2023-12-27', '2023-12-31', '2024-06-03 01:47:40', 1),
(10, '新春666元券', 'VSLSZH', 1, '2', 666, '歡慶新春666', 1680, '2024-02-08', '2024-02-10', '2024-06-06 03:46:23', 1),
(11, '商品滿額85折', 'KMFUUD', 1, '%折扣', 85, '滿1000元 享85折', 1000, '2024-05-28', '2024-06-30', '2024-06-06 01:44:33', 1),
(12, '商品滿額9折', 'D82PZL', 1, '%折扣', 90, '滿800元 享9折', 800, '2024-06-01', '2024-06-30', '2024-06-06 01:46:38', 1),
(13, '商品滿500減50', 'B74HFM', 1, '固定金額', 50, '滿500元 減50', 500, '2024-07-01', '2024-07-31', '2024-06-02 01:35:02', 1),
(14, '新品85折', '6B6AG5', 1, '%折扣', 85, '新品享85折', 1500, '2024-08-01', '2024-08-31', '2024-06-06 07:49:03', 1),
(15, '商品春季大促88折', 'E605KK', 1, '%折扣', 88, '春季大促 享88折', 880, '2024-09-01', '2024-09-30', '2024-06-06 07:49:12', 1),
(16, '新客滿200減50', '6C15FU', 1, '固定金額', 20, '滿200元 減20', 200, '2024-05-01', '2026-12-31', '2024-06-02 01:35:02', 1),
(17, '新客住宿85折', '7FISUA', 2, '%折扣', 85, '住宿享85折', 1000, '2024-05-01', '2026-12-31', '2024-06-06 07:49:18', 1),
(18, '住宿9折', 'QCYE1E', 2, '%折扣', 90, '住宿享9折', 1000, '2024-06-01', '2024-06-30', '2024-06-06 07:49:22', 1),
(19, '住宿滿3晚減100', 'FM96TU', 2, '固定金額', 100, '住宿滿3晚 減100', 2000, '2024-07-01', '2024-07-31', '2024-06-06 07:48:23', 1),
(20, '暑假特惠85折', 'XQZ5WY', 2, '%折扣', 85, '暑假特惠 享85折', 1500, '2024-08-01', '2024-08-31', '2024-06-06 07:49:26', 1),
(21, '寒假大促9折', '7QCMRL', 2, '%折扣', 90, '寒假大促 享9折', 1500, '2024-12-01', '2024-12-31', '2024-06-06 07:49:30', 1),
(22, '週末特惠減50', 'IIU252', 2, '固定金額', 50, '週末特惠 減50', 500, '2024-12-01', '2024-12-31', '2024-06-06 07:48:12', 1),
(23, '新客課程85折', 'QVSE6O', 3, '%折扣', 85, '課程享85折', 1000, '2024-05-01', '2026-12-31', '2024-06-06 07:47:08', 1),
(24, '課程9折', 'B9516V', 3, '%折扣', 90, '課程享9折', 1000, '2024-06-01', '2024-06-30', '2024-06-06 07:47:12', 1),
(25, '滿1000減100', 'T3RJIW', 3, '固定金額', 100, '滿1000元 減100', 1000, '2024-07-01', '2024-07-31', '2024-06-02 01:35:02', 1),
(26, '新課程85折', 'INKIDU', 3, '%折扣', 85, '新課程享85折', 1000, '2024-08-01', '2024-08-31', '2024-06-06 07:47:15', 1),
(27, '限時優惠9折', 'NK394F', 3, '%折扣', 90, '限時優惠 享9折', 1000, '2024-09-01', '2024-09-30', '2024-06-06 07:47:18', 1),
(28, '新年特惠減50', '7QJZTR', 3, '固定金額', 50, '新年特惠 減50', 500, '2024-01-01', '2024-01-31', '2024-06-02 01:35:02', 1),
(29, '商品滿額85折', 'E94QQO', 1, '%折扣', 85, '滿1000元 享85折', 1000, '2024-05-28', '2024-06-30', '2024-06-06 01:44:20', 1),
(30, '商品滿額9折', '9AOODU', 1, '%折扣', 90, '滿800元 享9折', 800, '2024-06-01', '2024-06-30', '2024-06-06 01:45:27', 1),
(31, '商品滿500減50', 'PY1WQY', 1, '固定金額', 50, '滿500元 減50', 500, '2024-07-01', '2024-07-31', '2024-06-02 01:45:18', 1),
(32, '新品85折', 'UZFUZ8', 1, '%折扣', 85, '新品享85折', 1000, '2024-08-01', '2024-08-31', '2024-06-06 07:47:23', 1),
(33, '春季大促88折', 'OJ9IMK', 1, '%折扣', 88, '春季大促 享88折', 1000, '2024-09-01', '2024-09-30', '2024-06-06 09:48:10', 1),
(34, '新客滿200減20', 'IE39P5', 1, '固定金額', 20, '滿200元 減20', 200, '2024-05-01', '2026-12-31', '2024-06-02 01:45:18', 1),
(35, '新客住宿85折', 'KMCF15', 2, '%折扣', 85, '住宿享85折', 1000, '2024-05-01', '2026-12-31', '2024-06-06 07:47:30', 1),
(36, '住宿9折', 'WUWTCN', 2, '%折扣', 90, '住宿享9折', 1000, '2024-06-01', '2024-06-30', '2024-06-06 07:47:33', 1),
(37, '住宿滿3晚減100', 'MWPDTG', 2, '固定金額', 100, '住宿滿3晚 減100', 2000, '2024-07-01', '2024-05-01', '2024-05-31 01:45:18', 1),
(38, '暑假特惠85折', '44BL50', 2, '%折扣', 85, '暑假特惠 享85折', 1000, '2024-08-01', '2024-08-31', '2024-06-06 07:47:36', 1),
(39, '寒假大促9折', '41XI3I', 2, '%折扣', 90, '寒假大促 享9折', 1000, '2024-12-01', '2024-12-31', '2024-06-06 07:47:39', 1),
(40, '週末特惠減50', '4M21VA', 2, '固定金額', 50, '週末特惠 減50', 500, '2024-11-01', '2024-11-30', '2024-06-06 07:47:56', 1),
(41, '新客課程85折', 'QSYFQE', 3, '%折扣', 85, '課程享85折', 1500, '2024-05-01', '2026-12-31', '2024-06-06 07:49:57', 1),
(42, '課程9折', 'NLLJEP', 3, '%折扣', 90, '課程享9折', 1500, '2024-06-01', '2024-06-30', '2024-06-06 07:49:00', 1),
(43, '滿1000減100', 'J3C813', 3, '固定金額', 100, '滿1000元 減100', 1000, '2024-07-01', '2024-07-31', '2024-06-02 01:45:18', 1),
(44, '新課程85折', 'B2YWJI', 3, '%折扣', 85, '新課程享85折', 1500, '2024-08-01', '2024-08-31', '2024-06-06 07:49:51', 1),
(45, '限時優惠9折', 'Z8R7CE', 3, '%折扣', 90, '限時優惠 享9折', 1500, '2024-09-01', '2024-09-30', '2024-06-06 07:49:43', 1),
(46, '新年特惠減50', '41S347', 3, '固定金額', 50, '新年特惠 減50', 500, '2024-01-01', '2024-01-31', '2024-06-02 01:45:18', 1),
(47, '春節特惠85折', 'BQSG1B', 1, '%折扣', 85, '春節特惠 享85折', 1500, '2024-02-01', '2024-02-28', '2024-06-06 07:49:59', 1),
(48, '夏日特惠9折', '8TRWEZ', 1, '%折扣', 90, '夏日特惠 享9折', 1500, '2024-03-01', '2024-03-31', '2024-06-06 07:49:33', 1),
(49, '秋季特惠95折', 'E1FRYZ', 1, '%折扣', 95, '秋季特惠 享95折', 800, '2024-04-01', '2024-04-30', '2024-06-06 07:49:36', 1),
(50, '冬季特惠8折', '3W880P', 1, '%折扣', 80, '冬季特惠 享8折', 1500, '2024-05-01', '2024-05-31', '2024-06-06 07:49:54', 1),
(51, '週年慶9折', '3HF7UC', 1, '%折扣', 90, '週年慶 享9折', 1000, '2024-06-01', '2024-06-30', '2024-06-06 07:47:02', 1),
(52, '感恩節特惠85折', 'V2ASQ6', 1, '%折扣', 85, '感恩節特惠 享85折', 1500, '2024-07-01', '2024-07-31', '2024-06-06 07:49:48', 1),
(53, '聖誕節特惠9折', 'QCNVFD', 1, '%折扣', 90, '聖誕節特惠 享9折', 1500, '2024-12-01', '2024-12-31', '2024-06-06 07:49:40', 1),
(54, '黑五特惠8折', 'UG2WBK', 1, '%折扣', 80, '黑五特惠 享8折', 1500, '2024-11-01', '2024-11-30', '2024-06-06 07:49:46', 1),
(55, '汪汪端午住飯店', 'J2PIUU', 2, '固定金額', 100, '汪汪住旅館', 1000, '2024-06-06', '2024-06-10', '2024-06-06 11:23:59', 1),
(56, '汪汪住飯店-寒假', '1BMSIK', 2, '固定金額', 500, 'test', 1000, '2025-01-20', '2025-02-20', '2024-06-06 10:37:06', 1),
(57, '汪汪住飯店-暑假', 'A990B2', 2, '%折扣', 80, 'test', 1000, '2024-07-01', '2024-08-31', '2024-06-06 10:36:15', 1),
(58, '暑期課程85折', '0VFRXI', 3, '%折扣', 85, '暑假上課85折', 2000, '2024-07-01', '2024-08-31', '2024-06-06 11:30:16', 1);

-- --------------------------------------------------------

--
-- 資料表結構 `coupons_category`
--

CREATE TABLE `coupons_category` (
  `id` int(5) NOT NULL,
  `name` varchar(20) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- 傾印資料表的資料 `coupons_category`
--

INSERT INTO `coupons_category` (`id`, `name`) VALUES
(1, '商品'),
(2, '寵物旅館'),
(3, '線上課程');

-- --------------------------------------------------------


--
-- 資料表索引 `coupons`
--
ALTER TABLE `coupons`
  ADD PRIMARY KEY (`id`);

--
-- 資料表索引 `coupons_category`
--
ALTER TABLE `coupons_category`
  ADD PRIMARY KEY (`id`);


--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupons`
--
ALTER TABLE `coupons`
  MODIFY `id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=60;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `coupons_category`
--
ALTER TABLE `coupons_category`
  MODIFY `id` int(5) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `users`
--
ALTER TABLE `users`
  MODIFY `id` int(6) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=302;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
